//Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

// Console.WriteLine("Ввведите число");
// int N = Convert.ToInt32(Console.ReadLine());
// int Sum(int num)
// {
//     if (num == 1)
//     {
//     return 1;
//     }
//     Console.Write(num);
//     return Sum(num - 1);   
// }
// int nat= Sum(N);

// Console.WriteLine((nat));



// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30

// Console.WriteLine("Ввведите M");
// int M = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Ввведите N");
// int N = Convert.ToInt32(Console.ReadLine());
// int sum = 0;
// for (int i = M; i <= N; i++)
// {
//     sum = sum + i;
// }
// Console.WriteLine(sum);



